import 'package:flutter/material.dart';
import 'package:hive/hive.dart';
import 'package:hive_flutter/hive_flutter.dart';

class SupportScreen extends StatefulWidget {
  const SupportScreen({super.key});

  @override
  State<SupportScreen> createState() => _SupportScreenState();
}

class _SupportScreenState extends State<SupportScreen> {
  late Box chatBox;
  List<Map<String, String>> messages = [
    {
      "text": "Сұрағыңызды жазыңыз немесе ұсыныстардың ішінен таңдаңыз.",
      "sender": "Бот",
    },
  ];

  String? _selectedTopic;
  bool _showHelpQuestion = false;

  @override
  void initState() {
    super.initState();
    _initHive();
  }

  Future<void> _initHive() async {
    await Hive.initFlutter(); // Инициализируем Hive
    chatBox = await Hive.openBox('chatBox'); // Открываем Box
    _loadMessages();
  }

  void _loadMessages() {
    final storedMessages = chatBox.get('messages', defaultValue: []);
    setState(() {
      messages = List<Map<String, String>>.from(
        storedMessages.map((item) => Map<String, String>.from(item)),
      );
    });
  }

  void _saveMessages() {
    chatBox.put('messages', messages);
  }

  void _clearChat() {
    setState(() {
      messages = [
        {
          "text": "Сұрағыңызды жазыңыз немесе ұсыныстардың ішінен таңдаңыз.",
          "sender": "Бот",
        },
      ];
      _saveMessages(); // Сохраняем изменения в Hive
      _showHelpQuestion = false;
    });
  }

  void _askForMoreHelp() {
    setState(() {
      _showHelpQuestion = true;
    });
  }

  final Map<String, Map<String, String>> questionsByTopic = {
    // 📌 1. General information about the app
    "📌 1. Қосымша туралы жалпы ақпарат": {
      "Қолданба қалай жұмыс істейді?":
          "Қолданба полициямен және төтенше жағдайлар қызметтерімен байланысуға арналған. Бұл полицияға қоңырау шалуға, шағым түсіруге, оқиғалар туралы ақпарат алуға және жергілікті полиция қызметкерлерімен байланыста болуға мүмкіндік береді. Пайдаланушы сұрақ қоя алады, фотосурет немесе видео жібере алады және өз аймағындағы қылмыс туралы хабарламаларға жазыла алады.",
      "Қосымшаны пайдалану үшін маған тіркелу керек пе?":
          "Кейбір функциялар тіркеусіз қол жетімді, мысалы, қауіпсіздік жаңалықтарын қарау. Дегенмен, шағым беру, полицияға қоңырау шалу немесе полиция қызметкерімен байланысу үшін тіркелгі жасау қажет болуы мүмкін.",
      "Қолданбадағы тілді қалай өзгертуге болады?":
          "Қолданба параметрлерінде тілді таңдау опциясы бар. Параметрлер → Тіл тармағына өтіп, қажетті опцияны таңдауға болады.",
      "Мен қолданбаны жасырын түрде пайдалана аламын ба?":
          "Иә, ескертулер мен жаңалықтарды қарау сияқты кейбір мүмкіндіктер тіркеусіз қолжетімді. Алайда, өтініш беру үшін байланыс ақпаратын ұсыну қажет болуы мүмкін.",
      "Мен паролімді ұмытып қалдым, оны қалай қалпына келтіруге болады?":
          "Кіру экранында\" құпия сөзіңізді Ұмыттыңыз ба? \" деген түйме бар.Оны нұқыңыз, электрондық поштаңызды немесе телефон нөміріңізді енгізіңіз, сонда сіз кіруді қалпына келтіру туралы нұсқаулар аласыз.",
      "Қолданба шұғыл қоңырауларды қолдай ма?":
          "Иә, қолданбада полицияға шұғыл қоңырау шалу функциясы бар. Көмекке шұғыл сигнал жіберу үшін SOS түймесін басуға болады.",
      "Егер мен өз қаламда болмасам, шағым жіберуге бола ма?":
          "Иә, қолданба орналасқан жеріңізге қарамастан шағымдар мен өтініштерді беруге мүмкіндік береді. Деректер тиісті полиция бөліміне жіберіледі..",
    },
    // 🚔 2. Полиция мен төтенше жағдайларды шақыру
    "🚔 2. Полиция мен төтенше жағдайларды шақыру": {
      "Қосымша арқылы полицияға қалай қоңырау шалуға болады?":
          "Сіз\" полицияға Қоңырау шалу \" түймесін басып, оқиғаның түрін таңдап, қажет болған жағдайда түсініктеме, фотосурет немесе бейне қоса аласыз.",
      "Полиция шақырған кезде қандай ақпарат беруім керек?":
          "Оқиғаның орнын, түрін және байланыс ақпаратын (егер сіз жасырын түрде қоңырау шалмасаңыз) көрсету өте аз қажет.",
      "Байланыс кезінде фотосурет немесе видео жіберуге бола ма?":
          "Иә, қолданба жағдайды дәлірек сипаттау үшін фотосуреттерді, бейнелерді және аудио файлдарды тіркеуге мүмкіндік береді.",
      "Полиция қолданбаның қоңырауларына қаншалықты тез жауап береді?":
          "Реакция жылдамдығы оқиға түріне және қызметтердің жұмыс жүктемесіне байланысты. Шұғыл қоңырауларға басымдық беріледі.",
      "Егер маған қауіп төніп, сөйлей алмасам, не істеуім керек?":
          "Үнсіз Қоңырау шалу функциясын пайдаланыңыз-нақты орналасқан жері туралы анықтама алу үшін сигнал жіберіңіз, сонда полиция дыбыстық ескертусіз хабарлама алады.",
      "Интернетке қосылусыз шұғыл хабарлама жіберуге бола ма?":
          "Кейбір функциялар SMS арқылы жұмыс істейді, бірақ қосымшаның толық жұмыс істеуі үшін интернет байланысы ұсынылады.",
      "Қолданбада көмекке жылдам қоңырау шалу үшін\" SOS \" функциясы бар ма?":
          "Иә, SOS түймесі сіздің орналасқан жеріңіз туралы дереу полицияға сигнал жібереді.",
      "Егер қолданба маңызды сәтте жұмыс істемесе, не істеуім керек?":
          "Полицияға әдеттегі нөмір бойынша қоңырау шалып көріңіз. Сондай-ақ, интернет немесе ұялы байланыс байланысы бар екеніне көз жеткізіңіз..",
    },
    // 📝 3. Өтініш немесе шағым беру
    "📝 3. Өтініш немесе шағым беру": {
      "Полицияның әрекетіне қалай шағым түсіруге болады?":
          "\"Шағым беру\" бөлімінде сіз емдеу санатын таңдай аласыз, жағдайды сипаттай аласыз және дәлелдемелерді қоса аласыз.",
      "Қосымша арқылы қылмыс туралы арыз беруге бола ма?":
          "Иә, өтініш құқық қорғау органдары қарайтын өтініштерді жіберуге мүмкіндік береді.",
      "Менің өтінішімнің мәртебесін қалай білуге болады?":
          "\"Менің Мәлімдемелерім\" бөлімінде сұрауды өңдеу күйін бақылауға болады",
      "Егер мен өтінішімде қате жіберсем, не істеуім керек?":
          "Сіз қосымша ақпаратты жібере аласыз немесе егер ол әлі өңделмеген болса, оны түзете аласыз.",
      "Берілген шағымды өзгертуге немесе жоюға бола ма?":
          "Егер ол әлі жұмысқа жіберілмеген болса, шағымның күшін жоюға болады.",
      "Өтінішке қандай дәлелдемелер қоса берілуі мүмкін?":
          "Фотосуреттер, бейнелер, аудио файлдар және мәтіндік құжаттар.",
      "Шағым түскеннен кейін менің деректерім кімге беріледі?":
          "Тергеуге тек уәкілетті органдар ғана қатысады.",
      "Менің ісімді кім тергейтінін қалай білуге болады?":
          "Тағайындалған полиция қызметкері туралы ақпарат\" Өтініш Мәртебесі\" бөлімінде пайда болады..",
    },
    // 🔎 4. Қылмыстар мен ескертулер туралы ақпарат
    "🔎 4. Қылмыстар мен ескертулер туралы ақпарат": {
      "Менің аймағымдағы қылмыстар туралы қосымша арқылы білуге бола ма?":
          "Иә,\" Жаңалықтар \" бөлімінде оқыс оқиғалар туралы Хабарламалар жариялануда.",
      "Менің қаламдағы оқиғалар туралы хабарламаларға қалай жазылуға болады?":
          "Параметрлерде аймағыңыз үшін хабарландыруларды қосуға болады.",
      "Күдікті әрекеттер туралы хабарлауға бола ма?":
          "Иә,\" оқиға туралы Хабарлау \" бөлімінде ақпаратты жасырын түрде жіберуге болады.",
      "Егер мен қылмыстың куәсі болсам, не істеуім керек?":
          "Қосымша арқылы полицияға қоңырау шалыңыз немесе жедел жәрдем нөміріне қоңырау шалыңыз.",
      "Жоғалған адам туралы ақпарат жіберуге бола ма?":
          "Иә, жоғалған адамдар туралы ақпаратты \"Іздеу\" бөлімінде қалдыра аласыз.",
      "Алаяқтық туралы ескертулердің бар-жоғын қалай тексеруге болады?":
          "Бөлімде\" сақ болыңыз, алаяқтар!\"қазіргі уақытта ескертулер жариялануда.",
    },
    // 💬 5. Полициямен байланыс
    "💬 5. Полициямен байланыс": {
      "Қосымша арқылы учаскелік полиция қызметкерімен қалай байланысуға болады?":
          "Сіз учаскелік полиция қызметкерінің байланыстарын\" Менің учаскелік полиция қызметкерім\" бөлімінен таба аласыз.",
      "Қосымша арқылы полицияға жазылуға бола ма?":
          "Иә, онлайн тіркелгі арқылы.",
      "Полицияның жұмысы туралы шолуды қалай қалдыруға болады?":
          "Бөлімде\" Пікірлер\" қызметкерлердің жұмысын бағалауға болады.",
      "Чатта полиция қызметкеріне сұрақ қоюға бола ма?":
          "Иә, егер бұл функцияға сіздің аймағыңызда қолдау көрсетілсе.",
      "Егер менің сұрағым жауапсыз қалса, не істеуім керек?":
          "Қайта жазуға тырысыңыз немесе телефон арқылы хабарласыңыз.",
      "Осы аймақтың қауіпсіздігін талқылау үшін басқа пайдаланушылармен чат бар ма?":
          "Қолданбаның кейбір нұсқалары топтық чаттарды қолдайды.",
    },
    // 🔐 6. Құпиялылық және деректер қауіпсіздігі
    "🔐 6. Құпиялылық және деректер қауіпсіздігі": {
      "Қолданба қандай деректерді жинайды?":
          "Жұмысқа қойылатын минималды талаптар: аты, контактілері, орналасқан жері (қосылған болса).",
      "Мен қосымшаны жеке ақпаратсыз пайдалана аламын ба?":
          "Кейбір функциялар тіркеусіз қол жетімді.",
      "Тіркелгіңізді бұзудан қалай қорғауға болады?":
          "Күрделі құпия сөзді және екі факторлы аутентификацияны қолданыңыз.",
      "Менің шағымдарым мен хабарламаларыма кім қол жеткізе алады?":
          "Тек құқық қорғау органдары.",
      "Мен барлық деректерді жүйеден өшіре аламын ба?":
          "Иә, тіркелгі параметрлерінде деректерді жою функциясы бар.",
    },
    // ⚙️ 7. Техникалық мәселелер мен проблемалар
    "⚙️ 7. Техникалық мәселелер мен мәселелер": {
      "Қолданба жұмыс істемейді, мен не істеуім керек?":
          "Құрылғыны қайта іске қосып, қолданбаны жаңартып көріңіз.",
      "Қолданбаны соңғы нұсқаға қалай жаңартуға болады?":
          "App store дүкенінде (App Store немесе Google Play) \"Жаңарту\" түймесін басыңыз.",
      "Қолданбаны Интернетсіз пайдалана аламын ба?":
          "Кейбір функциялар офлайн режимде жұмыс істейді, бірақ толық қол жеткізу үшін Интернет қажет.",
      "Қолданбадан хабарландыруларды қалай өшіруге болады?":
          "Параметрлерде сіз қандай хабарландыруларды алу керектігін таңдай аласыз.",
      "Қолданба ескі телефондарда жұмыс істеуді қолдай ма?":
          "Иә, бірақ функционалдығы шектеулі.",
      "Егер мен қолданбаға спам немесе жалған хабарламалар алсам, не істеуім керек?":
          "Бұл туралы тұтынушыларға қызмет көрсету орталығына хабарлаңыз немесе жіберушіні блоктаңыз.",
    },
  };

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Онлайн көмекші"),
        backgroundColor: Colors.white,
        foregroundColor: Colors.black,
      ),
      body: Column(
        children: [
          Expanded(
            child: ListView.builder(
              padding: EdgeInsets.all(10),
              itemCount: messages.length,
              itemBuilder: (context, index) {
                final message = messages[index];
                bool isUser = message["sender"] == "user";

                return Align(
                  alignment:
                      isUser ? Alignment.centerRight : Alignment.centerLeft,
                  child: Container(
                    padding: EdgeInsets.all(12),
                    margin: EdgeInsets.symmetric(vertical: 4, horizontal: 8),
                    decoration: BoxDecoration(
                      color: isUser ? Colors.blue[300] : Colors.grey[300],
                      borderRadius: BorderRadius.circular(10),
                    ),
                    child: Text(
                      message["text"]!,
                      style: TextStyle(fontSize: 16),
                    ),
                  ),
                );
              },
            ),
          ),
          if (_showHelpQuestion)
            Padding(
              padding: EdgeInsets.all(8),
              child: Column(
                children: [
                  Text(
                    "Сізге енді менің көмегім керек пе?",
                    style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
                  ),
                  Row(
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: [
                      ElevatedButton(
                        onPressed: () {
                          setState(() {
                            _showHelpQuestion = false;
                          });
                        },
                        child: Text("Ия"),
                      ),
                      SizedBox(width: 10),
                      ElevatedButton(
                        onPressed: _clearChat,
                        child: Text("Жоқ"),
                        style: ElevatedButton.styleFrom(
                          backgroundColor: Colors.red,
                        ),
                      ),
                    ],
                  ),
                ],
              ),
            ),
          if (!_showHelpQuestion)
            Padding(
              padding: EdgeInsets.all(8),
              child: Wrap(
                spacing: 8,
                runSpacing: 8,
                children:
                    _selectedTopic == null
                        ? questionsByTopic.keys.map((topic) {
                          return ElevatedButton(
                            style: ElevatedButton.styleFrom(
                              backgroundColor: Colors.white,
                              foregroundColor: Colors.blue,
                              side: BorderSide(color: Colors.blue),
                            ),
                            onPressed: () {
                              setState(() {
                                _selectedTopic = topic;
                              });
                            },
                            child: Text(topic),
                          );
                        }).toList()
                        : [
                          // 📌 Кнопки с вопросами внутри выбранной темы
                          ...questionsByTopic[_selectedTopic!]!.keys.map((
                            question,
                          ) {
                            return ElevatedButton(
                              style: ElevatedButton.styleFrom(
                                backgroundColor: Color(0xFFEFF2FE),
                                foregroundColor: Color(0xFF617CE7),
                                side: BorderSide(color: Colors.blue),
                              ),
                              onPressed: () {
                                setState(() {
                                  messages.add({
                                    "text": question,
                                    "sender": "user",
                                  });
                                  messages.add({
                                    "text":
                                        questionsByTopic[_selectedTopic!]![question]!,
                                    "sender": "bot",
                                  });
                                });
                                _saveMessages(); // Сохраняем обновленный список сообщений
                                Future.delayed(
                                  Duration(seconds: 1),
                                  _askForMoreHelp,
                                );
                              },
                              child: Text(question),
                            );
                          }).toList(),
                          ElevatedButton(
                            style: ElevatedButton.styleFrom(
                              backgroundColor: Colors.white,
                              foregroundColor: Colors.black,
                              side: BorderSide(color: Colors.red[800]!),
                            ),
                            onPressed: () {
                              setState(() {
                                _selectedTopic = null;
                              });
                            },
                            child: Text("🔄 Артқа"),
                          ),
                        ],
              ),
            ),
          SizedBox(height: 10),
          Padding(
            padding: EdgeInsets.all(8),
            child: Row(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                ElevatedButton(
                  style: ElevatedButton.styleFrom(
                    backgroundColor: Colors.red,
                    foregroundColor: Colors.white,
                    minimumSize: Size(200, 60),
                  ),
                  onPressed: _clearChat,
                  child: Text(
                    "🗑 Чатты өшіру",
                    style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                  ),
                ),
              ],
            ),
          ),
          SizedBox(height: 40),
        ],
      ),
    );
  }
}
